gw826943555/hal_gigadevice/gd32f527/standard_peripheral/source/gd32f527_fmc.c
/*!
    \file    gd32f527_fmc.c
    \brief   FMC driver

    \version 2026-01-31, V1.4.0, firmware for GD32F527
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/


#include "gd32f527_fmc.h"

/* write protection/CBUS read protection sector mask */
#define WP0_DRP_LOW_12BITS_MASK           ((uint64_t)0x0000000000000FFFU)
#define WP0_DRP_HIGH_8BITS_MASK           ((uint64_t)0x00000000000FF000U)
#define WP1_DRP_LOW_12BITS_MASK           ((uint64_t)0x00000000FFF00000U)
#define WP1_DRP_HIGH_8BITS_MASK           ((uint64_t)0x000000FF00000000U)

/* write protection/CBUS read protection sector offset */
#define WP0_DRP_LOW_12BITS_OFFSET         ((uint32_t)0x00000000U)
#define WP0_DRP_HIGH_8BITS_OFFSET         ((uint32_t)0x0000000CU)
#define WP1_DRP_LOW_12BITS_OFFSET         ((uint32_t)0x00000014U)
#define WP1_DRP_HIGH_8BITS_OFFSET         ((uint32_t)0x00000020U)

/* FMC register bit offset */
#define OBCTL0_WP0_L_OFFSET               ((uint32_t)0x00000010U)           /*!< bit offset of WP0[11:0] in OBCTL1 */
#define OBCTL1_WP0_H_OFFSET               ((uint32_t)0x00000000U)           /*!< bit offset of WP0[19:12] in OBCTL1 */
#define OBCTL1_WP1_L_OFFSET               ((uint32_t)0x00000010U)           /*!< bit offset of WP1[11:0] in OBCTL1 */
#define OBCTL1_WP1_H_OFFSET               ((uint32_t)0x00000008U)           /*!< bit offset of WP1[19:12] in OBCTL1 */

/* EFUSE register bit offset */
#define EFUSE_ADDR_EFSIZE_OFFSET          ((uint32_t)(0x00000008U))         /*!< EFSIZE OFFSET in register EFUSE_ADDR */


/*!
    \brief      unlock the main FMC operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_unlock(void)
{
    if((RESET != (FMC_CTL & FMC_CTL_LK))) {
        /* write the FMC key */
        FMC_KEY = UNLOCK_KEY0;
        FMC_KEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the main FMC operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_lock(void)
{
    /* set the LK bit*/
    FMC_CTL |= FMC_CTL_LK;
}

/*!
    \brief      FMC erase page
    \param[in]  page_addr: the page address to be erased.
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_RDCERR: CBUS data read protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size not match error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_OPERR: operation error
      \arg        FMC_LDECCDET: two bits ECC error when load code from flash/OTP1/bootloader
      \arg        FMC_TOERR: timeout error
*/
fmc_state_enum fmc_page_erase(uint32_t page_addr)
{
    fmc_state_enum fmc_state = FMC_READY;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* unlock page erase operation */
        FMC_PEKEY = UNLOCK_PE_KEY;

        /* start page erase */
        FMC_PECFG = FMC_PECFG_PE_EN | page_addr;
        FMC_CTL |= FMC_CTL_SER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        FMC_PECFG &= ~FMC_PECFG_PE_EN;
        FMC_CTL &= ~FMC_CTL_SER;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      FMC erase sector
    \param[in]  fmc_sector: select the sector to erase
                only one parameter can be selected which is shown as below:
      \arg        CTL_SECTOR_NUMBER_x: sector x(x = 0,1,2...53)
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_RDCERR: CBUS data read protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size not match error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_OPERR: operation error
      \arg        FMC_LDECCDET: two bits ECC error when load code from flash/OTP1/bootloader
      \arg        FMC_TOERR: timeout error
*/
fmc_state_enum fmc_sector_erase(uint32_t fmc_sector)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start sector erase */
        FMC_CTL &= ~FMC_CTL_SER;
        FMC_CTL &= ~(FMC_CTL_SN | FMC_CTL_SN_5);
        FMC_CTL |= FMC_CTL_SER | fmc_sector;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

