gw826943555/hal_gigadevice/gd32f527/standard_peripheral/source/gd32f527_fmc.c
    if(RESET != (temp_val & FMC_FLAG_BUSY)) {
        fmc_state = FMC_BUSY;
    } else if(RESET != (temp_val & FMC_FLAG_RDCERR)) {
        fmc_state = FMC_RDCERR;
    } else if(RESET != (temp_val & FMC_FLAG_PGSERR)) {
        fmc_state = FMC_PGSERR;
    } else if(RESET != (temp_val & FMC_FLAG_PGMERR)) {
        fmc_state = FMC_PGMERR;
    } else if(RESET != (temp_val & FMC_FLAG_PGAERR)) {
        fmc_state = FMC_PGAERR;
    } else if(RESET != (temp_val & FMC_FLAG_WPERR)) {
        fmc_state = FMC_WPERR;
    } else if(RESET != (temp_val & FMC_FLAG_OPERR)) {
        fmc_state = FMC_OPERR;
    } else if(RESET != (temp_val & FMC_FLAG_LDECCDET)) {
        fmc_state = FMC_LDECCDET;
    } else {
        fmc_state = FMC_READY;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC is ready or not
    \param[in]  timeout: timeout value
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_RDCERR: CBUS data read protection error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size not match error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_OPERR: operation error
      \arg        FMC_LDECCDET: two bits ECC error when load code from flash/OTP1/bootloader
      \arg        FMC_TOERR: timeout error
*/
fmc_state_enum fmc_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_BUSY;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0U != timeout));

    if(0U == timeout) {
        fmc_state = FMC_TOERR;
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      unlock the EFUSE_CTL register
    \param[in]  none
    \param[out] none
    \retval     none
*/
void efuse_ctrl_unlock(void)
{
    /* clear the LK bit */
    EFUSE_CTL &= ~EFUSE_CTL_LK;
}

/*!
    \brief      lock the EFUSE_CTL register
    \param[in]  none
    \param[out] none
    \retval     none
*/
void efuse_ctrl_lock(void)
{
    /* set the LK bit */
    EFUSE_CTL |= EFUSE_CTL_LK;
}

/*!
    \brief      unlock the EFUSE_USER_DATA register
    \param[in]  none
    \param[out] none
    \retval     none
*/
void efuse_user_data_unlock(void)
{
    /* clear the UDLK bit */
    EFUSE_CTL &= ~EFUSE_CTL_UDLK;
}

/*!
    \brief      lock the EFUSE_USER_DATA register
    \param[in]  none
    \param[out] none
    \retval     none
*/
void efuse_user_data_lock(void)
{
    /* set the UDLK bit */
    EFUSE_CTL |= EFUSE_CTL_UDLK;
}

/*!
    \brief      read EFUSE value
    \param[in]  ef_addr: EFUSE address
      \arg        EFUSE_CTL_EFADDR: efuse controladdress
      \arg        USER_DATA_EFADDR: user data address
    \param[in]  size: byte count to read
    \param[out] buf: the buffer for storing read-out EFUSE data
    \retval     state of EFUSE:
      \arg        EFUSE_READY: EFUSE operation has been completed
      \arg        EFUSE_BUSY: EFUSE operation is in progress
      \arg        EFUSE_OBER: overstep boundary error
      \arg        EFUSE_TOERR: EFUSE timeout error
*/
efuse_state_enum efuse_read(uint32_t ef_addr, uint32_t size, uint32_t buf[])
{
    uint32_t reg_addr = 0U;
    uint8_t addr_valid = 0U;
    efuse_state_enum efuse_state = EFUSE_OBER;

    if(1U == size) {
        if(EFUSE_CTL_EFADDR == ef_addr) {
            /* read efuse control*/
            reg_addr = (uint32_t)(FMC + EFUSE_CTL_OFFSET);
            addr_valid = 1U;
        } else if(USER_DATA_EFADDR == ef_addr) {
            /* read user data */
            reg_addr = (uint32_t)(FMC + EFUSE_USER_DATA_OFFSET);
            addr_valid = 1U;
        } else {
            addr_valid = 0U;
        }

        if(1U == addr_valid) {
            /* clear the RDIF bit if it is SET */
            efuse_flag_clear(EFUSE_RDIC);

            /* make sure no overstep boundary errors */
            if(RESET == efuse_flag_get(EFUSE_OBERIF)) {
                /* EFUSE read operation */
                EFUSE_CS &= (~EFUSE_CS_EFRW);

                /* write the desired efuse address and size to the EFUSE_ADDR register */
                EFUSE_ADDR = (uint32_t)((1U << EFUSE_ADDR_EFSIZE_OFFSET) | ef_addr);

                /* start read EFUSE operation */
                EFUSE_CS |= EFUSE_CS_EFSTR;

                /* wait for the operation to complete */
                efuse_state = efuse_ready_wait(EFUSE_RDIF, EFUSE_TIMEOUT_COUNT);
                if(EFUSE_READY == efuse_state) {
                    /* read EFUSE data to buffer */
                    buf[0] = REG32(reg_addr);
                }
            }
        }
    }

    return efuse_state;
}

/*!
    \brief      write EFUSE
    \param[in]  ef_addr: EFUSE address
      \arg        EFUSE_CTL_EFADDR: efuse controladdress
      \arg        USER_DATA_EFADDR: user data address
    \param[in]  size: byte count to write, (1~1)
    \param[in]  ef_data: data to write EFUSE
    \param[out] none
    \retval     state of EFUSE:
      \arg        EFUSE_READY: EFUSE operation has been completed
      \arg        EFUSE_BUSY: EFUSE operation is in progress
      \arg        EFUSE_OBER: overstep boundary error
      \arg        EFUSE_TOERR: EFUSE timeout error
*/
efuse_state_enum efuse_write(uint32_t ef_addr, uint32_t size, uint8_t ef_data)
{
    uint32_t reg_addr = 0U;
    uint8_t addr_valid = 0U;
    efuse_state_enum efuse_state = EFUSE_OBER;

    if(1U == size) {
        if(EFUSE_CTL_EFADDR == ef_addr) {
            /* program efuse control*/
            reg_addr = (uint32_t)(FMC + EFUSE_CTL_OFFSET);
            addr_valid = 1U;
        } else if(USER_DATA_EFADDR == ef_addr) {
            /* program user data */
            reg_addr = (uint32_t)(FMC + EFUSE_USER_DATA_OFFSET);
            addr_valid = 1U;
        } else {
            addr_valid = 0U;
        }

